IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
<module name="FSS0_FSAS_0_OTFA_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_revid" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_revid" offset="0x0" width="32" description="">
		<bitfield id="REVID" width="32" begin="31" end="0" resetval="0x1196425472" description="REVID" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_scfg" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_scfg" offset="0x4" width="32" description="">
		<bitfield id="IDLE_MODE" width="2" begin="1" end="0" resetval="0x2" description="IDLE MODE" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_isr" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_isr" offset="0x8" width="32" description="">
		<bitfield id="MAC_ERR" width="4" begin="15" end="12" resetval="0x0" description="MAC error" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="WRT_ERR" width="4" begin="11" end="8" resetval="0x0" description="Write error" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="REGION_BV" width="4" begin="7" end="4" resetval="0x0" description="Region overflow boundary event caused by a burst transaction crossed a start or end of a region" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CTR_WKV" width="4" begin="3" end="0" resetval="0x0" description="AES mode 0 enabled region violated Wrt Once Per Wrt Key rule " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_is" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_is" offset="0xC" width="32" description="">
		<bitfield id="MAC_ERR" width="4" begin="15" end="12" resetval="0x0" description="MAC error" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="WRT_ERR" width="4" begin="11" end="8" resetval="0x0" description="Write error " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="REGION_BV" width="4" begin="7" end="4" resetval="0x0" description="Region overflow boundary event caused by a burst transaction crossed a start or end of a region" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CTR_WKV" width="4" begin="3" end="0" resetval="0x0" description="AES mode 0 enabled region violated Wrt Once Per Wrt Key rule " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_ies" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_ies" offset="0x10" width="32" description="">
		<bitfield id="MAC_ERR" width="4" begin="15" end="12" resetval="0x0" description="MAC error" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="WRT_ERR" width="4" begin="11" end="8" resetval="0x0" description="Write error" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="REGION_BV" width="4" begin="7" end="4" resetval="0x0" description="Region overflow boundary event caused by a burst transaction crossed a start or end of a region" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CTR_WKV" width="4" begin="3" end="0" resetval="0x0" description="AES mode 0 enabled region violated Wrt Once Per Wrt Key rule " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_iec" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_iec" offset="0x14" width="32" description="">
		<bitfield id="MAC_ERR" width="4" begin="15" end="12" resetval="0x0" description="MAC error" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="WRT_ERR" width="4" begin="11" end="8" resetval="0x0" description="Write error" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="REGION_BV" width="4" begin="7" end="4" resetval="0x0" description="Region overflow boundary event caused by a burst transaction crossed a start or end of a region" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CTR_WKV" width="4" begin="3" end="0" resetval="0x0" description="AES mode 0 enabled region violated Wrt Once Per Wrt Key rule " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_ccfg" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_ccfg" offset="0x18" width="32" description="">
		<bitfield id="MASTER_EN_RD" width="1" begin="31" end="31" resetval="0x0" description="This register controls the enabling the functionality of this IP Disabled and Bypass mode active" range="31" rwaccess="R/W"/> 
		<bitfield id="ERROR_RESP_EN" width="1" begin="9" end="9" resetval="0x0" description="This register controls the enabling the the ocp error response for mac errors " range="9" rwaccess="R/W"/> 
		<bitfield id="OTFA_WAIT" width="1" begin="8" end="8" resetval="0x0" description="This register allows the ability to stop accepting any new transactions from getting accepted and allow the current transactions to complete" range="8" rwaccess="R/W"/> 
		<bitfield id="CACHE_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="MAC cache enable" range="6" rwaccess="R/W"/> 
		<bitfield id="CACHE_EVICT_MODE" width="1" begin="5" end="5" resetval="0x0" description="cache evict mode" range="5" rwaccess="R/W"/> 
		<bitfield id="KEY_SIZE" width="1" begin="4" end="4" resetval="0x0" description="Key Size, 0 128 Bit 1 256 Bit" range="4" rwaccess="R/W"/> 
		<bitfield id="RD_WRT_OPT" width="4" begin="3" end="0" resetval="0x0" description="This register defines the static allocation of the AES cores to read transactions. The remainder will be allocated to write transactions" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_cstatus" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_cstatus" offset="0x1C" width="32" description="">
		<bitfield id="BUSY" width="1" begin="31" end="31" resetval="0x0" description="0 No transactions are active, crypto or none crypto   1 One or more transactions are active, crypto or none crypto " range="31" rwaccess="R"/> 
		<bitfield id="CRYPTO_BUSY" width="1" begin="30" end="30" resetval="0x0" description="0 No transactions are active, crypto or none crypto  1 One or more transactions are active, crypto or none crypto " range="30" rwaccess="R"/> 
		<bitfield id="RD_STALL_EVENT_CNT" width="14" begin="29" end="16" resetval="0x0" description="rd stall event do to lack of eng" range="29 - 16" rwaccess="R/W1TC"/> 
		<bitfield id="WRT_STALL_EVENT_CNT" width="14" begin="13" end="0" resetval="0x0" description="wrt stall event do to lack of eng" range="13 - 0" rwaccess="R/W1TC"/>
	</register>
