IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg0" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg0" offset="0x20" width="32" description="">
		<bitfield id="WRT_PROTECT0" width="1" begin="4" end="4" resetval="0x0" description="WRT protect" range="4" rwaccess="R/W"/> 
		<bitfield id="MAC_MODE0" width="2" begin="3" end="2" resetval="0x0" description="MAC mode" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="AES_MODE0" width="2" begin="1" end="0" resetval="0x0" description="AES mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst0" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst0" offset="0x24" width="32" description="">
		<bitfield id="M_START0" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the mac buffer in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst0" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst0" offset="0x28" width="32" description="">
		<bitfield id="R_START0" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi0" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi0" offset="0x2C" width="32" description="">
		<bitfield id="R_SIZE0" width="20" begin="19" end="0" resetval="0x0" description="This defines the size of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye00" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye00" offset="0x30" width="32" description="">
		<bitfield id="R_KEY_E00" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye01" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye01" offset="0x34" width="32" description="">
		<bitfield id="R_KEY_E01" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye02" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye02" offset="0x38" width="32" description="">
		<bitfield id="R_KEY_E02" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye03" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye03" offset="0x3C" width="32" description="">
		<bitfield id="R_KEY_E03" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye04" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye04" offset="0x40" width="32" description="">
		<bitfield id="R_KEY_E04" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye05" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye05" offset="0x44" width="32" description="">
		<bitfield id="R_KEY_E05" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye06" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye06" offset="0x48" width="32" description="">
		<bitfield id="R_KEY_E06" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye07" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye07" offset="0x4C" width="32" description="">
		<bitfield id="R_KEY_E07" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep00" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep00" offset="0x50" width="32" description="">
		<bitfield id="R_KEY_EP00" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep01" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep01" offset="0x54" width="32" description="">
		<bitfield id="R_KEY_EP01" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep02" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep02" offset="0x58" width="32" description="">
		<bitfield id="R_KEY_EP02" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep03" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep03" offset="0x5C" width="32" description="">
		<bitfield id="R_KEY_EP03" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep04" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep04" offset="0x60" width="32" description="">
		<bitfield id="R_KEY_EP04" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep05" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep05" offset="0x64" width="32" description="">
		<bitfield id="R_KEY_EP05" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep06" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep06" offset="0x68" width="32" description="">
		<bitfield id="R_KEY_EP06" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
