IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep07" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep07" offset="0x6C" width="32" description="">
		<bitfield id="R_KEY_EP07" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya00" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya00" offset="0x70" width="32" description="">
		<bitfield id="R_KEY_A00" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya01" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya01" offset="0x74" width="32" description="">
		<bitfield id="R_KEY_A01" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya02" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya02" offset="0x78" width="32" description="">
		<bitfield id="R_KEY_A02" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya03" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya03" offset="0x7C" width="32" description="">
		<bitfield id="R_KEY_A03" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap00" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap00" offset="0x80" width="32" description="">
		<bitfield id="R_KEY_AP00" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap01" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap01" offset="0x84" width="32" description="">
		<bitfield id="R_KEY_AP01" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap02" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap02" offset="0x88" width="32" description="">
		<bitfield id="R_KEY_AP02" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap03" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap03" offset="0x8C" width="32" description="">
		<bitfield id="R_KEY_AP03" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv00" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv00" offset="0x90" width="32" description="">
		<bitfield id="R_IV00" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv01" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv01" offset="0x94" width="32" description="">
		<bitfield id="R_IV01" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv02" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv02" offset="0x98" width="32" description="">
		<bitfield id="R_IV02" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv03" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv03" offset="0x9C" width="32" description="">
		<bitfield id="R_IV03" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg1" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg1" offset="0xA0" width="32" description="">
		<bitfield id="WRT_PROTECT1" width="1" begin="4" end="4" resetval="0x0" description="WRT protect" range="4" rwaccess="R/W"/> 
		<bitfield id="MAC_MODE1" width="2" begin="3" end="2" resetval="0x0" description="MAC mode" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="AES_MODE1" width="2" begin="1" end="0" resetval="0x0" description="AES mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst1" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst1" offset="0xA4" width="32" description="">
		<bitfield id="M_START1" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the mac buffer in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst1" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst1" offset="0xA8" width="32" description="">
		<bitfield id="R_START1" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi1" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi1" offset="0xAC" width="32" description="">
		<bitfield id="R_SIZE1" width="20" begin="19" end="0" resetval="0x0" description="This defines the size of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye10" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye10" offset="0xB0" width="32" description="">
		<bitfield id="R_KEY_E10" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye11" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye11" offset="0xB4" width="32" description="">
		<bitfield id="R_KEY_E11" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye12" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye12" offset="0xB8" width="32" description="">
		<bitfield id="R_KEY_E12" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
