IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye13" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye13" offset="0xBC" width="32" description="">
		<bitfield id="R_KEY_E13" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye14" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye14" offset="0xC0" width="32" description="">
		<bitfield id="R_KEY_E14" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye15" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye15" offset="0xC4" width="32" description="">
		<bitfield id="R_KEY_E15" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye16" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye16" offset="0xC8" width="32" description="">
		<bitfield id="R_KEY_E16" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye17" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye17" offset="0xCC" width="32" description="">
		<bitfield id="R_KEY_E17" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep10" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep10" offset="0xD0" width="32" description="">
		<bitfield id="R_KEY_EP10" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep11" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep11" offset="0xD4" width="32" description="">
		<bitfield id="R_KEY_EP11" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep12" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep12" offset="0xD8" width="32" description="">
		<bitfield id="R_KEY_EP12" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep13" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep13" offset="0xDC" width="32" description="">
		<bitfield id="R_KEY_EP13" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep14" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep14" offset="0xE0" width="32" description="">
		<bitfield id="R_KEY_EP14" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep15" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep15" offset="0xE4" width="32" description="">
		<bitfield id="R_KEY_EP15" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep16" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep16" offset="0xE8" width="32" description="">
		<bitfield id="R_KEY_EP16" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep17" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep17" offset="0xEC" width="32" description="">
		<bitfield id="R_KEY_EP17" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya10" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya10" offset="0xF0" width="32" description="">
		<bitfield id="R_KEY_A10" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya11" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya11" offset="0xF4" width="32" description="">
		<bitfield id="R_KEY_A11" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya12" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya12" offset="0xF8" width="32" description="">
		<bitfield id="R_KEY_A12" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya13" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya13" offset="0xFC" width="32" description="">
		<bitfield id="R_KEY_A13" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap10" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap10" offset="0x100" width="32" description="">
		<bitfield id="R_KEY_AP10" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap11" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap11" offset="0x104" width="32" description="">
		<bitfield id="R_KEY_AP11" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap12" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap12" offset="0x108" width="32" description="">
		<bitfield id="R_KEY_AP12" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap13" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap13" offset="0x10C" width="32" description="">
		<bitfield id="R_KEY_AP13" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv10" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv10" offset="0x110" width="32" description="">
		<bitfield id="R_IV10" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
