IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv11" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv11" offset="0x114" width="32" description="">
		<bitfield id="R_IV11" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv12" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv12" offset="0x118" width="32" description="">
		<bitfield id="R_IV12" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv13" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv13" offset="0x11C" width="32" description="">
		<bitfield id="R_IV13" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg2" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg2" offset="0x120" width="32" description="">
		<bitfield id="WRT_PROTECT2" width="1" begin="4" end="4" resetval="0x0" description="WRT protect" range="4" rwaccess="R/W"/> 
		<bitfield id="MAC_MODE2" width="2" begin="3" end="2" resetval="0x0" description="MAC mode" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="AES_MODE2" width="2" begin="1" end="0" resetval="0x0" description="AES mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst2" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst2" offset="0x124" width="32" description="">
		<bitfield id="M_START2" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the mac buffer in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst2" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst2" offset="0x128" width="32" description="">
		<bitfield id="R_START2" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi2" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi2" offset="0x12C" width="32" description="">
		<bitfield id="R_SIZE2" width="20" begin="19" end="0" resetval="0x0" description="This defines the size of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye20" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye20" offset="0x130" width="32" description="">
		<bitfield id="R_KEY_E20" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye21" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye21" offset="0x134" width="32" description="">
		<bitfield id="R_KEY_E21" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye22" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye22" offset="0x138" width="32" description="">
		<bitfield id="R_KEY_E22" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye23" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye23" offset="0x13C" width="32" description="">
		<bitfield id="R_KEY_E23" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye24" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye24" offset="0x140" width="32" description="">
		<bitfield id="R_KEY_E24" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye25" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye25" offset="0x144" width="32" description="">
		<bitfield id="R_KEY_E25" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye26" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye26" offset="0x148" width="32" description="">
		<bitfield id="R_KEY_E26" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye27" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye27" offset="0x14C" width="32" description="">
		<bitfield id="R_KEY_E27" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep20" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep20" offset="0x150" width="32" description="">
		<bitfield id="R_KEY_EP20" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep21" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep21" offset="0x154" width="32" description="">
		<bitfield id="R_KEY_EP21" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep22" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep22" offset="0x158" width="32" description="">
		<bitfield id="R_KEY_EP22" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep23" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep23" offset="0x15C" width="32" description="">
		<bitfield id="R_KEY_EP23" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
