IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep24" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep24" offset="0x160" width="32" description="">
		<bitfield id="R_KEY_EP24" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep25" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep25" offset="0x164" width="32" description="">
		<bitfield id="R_KEY_EP25" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep26" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep26" offset="0x168" width="32" description="">
		<bitfield id="R_KEY_EP26" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep27" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep27" offset="0x16C" width="32" description="">
		<bitfield id="R_KEY_EP27" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya20" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya20" offset="0x170" width="32" description="">
		<bitfield id="R_KEY_A20" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya21" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya21" offset="0x174" width="32" description="">
		<bitfield id="R_KEY_A21" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya22" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya22" offset="0x178" width="32" description="">
		<bitfield id="R_KEY_A22" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya23" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya23" offset="0x17C" width="32" description="">
		<bitfield id="R_KEY_A23" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap20" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap20" offset="0x180" width="32" description="">
		<bitfield id="R_KEY_AP20" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap21" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap21" offset="0x184" width="32" description="">
		<bitfield id="R_KEY_AP21" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap22" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap22" offset="0x188" width="32" description="">
		<bitfield id="R_KEY_AP22" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap23" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap23" offset="0x18C" width="32" description="">
		<bitfield id="R_KEY_AP23" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv20" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv20" offset="0x190" width="32" description="">
		<bitfield id="R_IV20" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv21" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv21" offset="0x194" width="32" description="">
		<bitfield id="R_IV21" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv22" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv22" offset="0x198" width="32" description="">
		<bitfield id="R_IV22" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv23" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv23" offset="0x19C" width="32" description="">
		<bitfield id="R_IV23" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg3" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgcfg3" offset="0x1A0" width="32" description="">
		<bitfield id="WRT_PROTECT3" width="1" begin="4" end="4" resetval="0x0" description="WRT protect" range="4" rwaccess="R/W"/> 
		<bitfield id="MAC_MODE3" width="2" begin="3" end="2" resetval="0x0" description="MAC mode" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="AES_MODE3" width="2" begin="1" end="0" resetval="0x0" description="AES mode" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst3" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgmacst3" offset="0x1A4" width="32" description="">
		<bitfield id="M_START3" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the mac buffer in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst3" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgst3" offset="0x1A8" width="32" description="">
		<bitfield id="R_START3" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi3" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rgsi3" offset="0x1AC" width="32" description="">
		<bitfield id="R_SIZE3" width="20" begin="19" end="0" resetval="0x0" description="This defines the size of the crypto region in 4KBytes steps" range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye30" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye30" offset="0x1B0" width="32" description="">
		<bitfield id="R_KEY_E30" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye31" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye31" offset="0x1B4" width="32" description="">
		<bitfield id="R_KEY_E31" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye32" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye32" offset="0x1B8" width="32" description="">
		<bitfield id="R_KEY_E32" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
