IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye33" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye33" offset="0x1BC" width="32" description="">
		<bitfield id="R_KEY_E33" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye34" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye34" offset="0x1C0" width="32" description="">
		<bitfield id="R_KEY_E34" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye35" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye35" offset="0x1C4" width="32" description="">
		<bitfield id="R_KEY_E35" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye36" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye36" offset="0x1C8" width="32" description="">
		<bitfield id="R_KEY_E36" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye37" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeye37" offset="0x1CC" width="32" description="">
		<bitfield id="R_KEY_E37" width="32" begin="31" end="0" resetval="0x0" description="Key E" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep30" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep30" offset="0x1D0" width="32" description="">
		<bitfield id="R_KEY_EP30" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep31" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep31" offset="0x1D4" width="32" description="">
		<bitfield id="R_KEY_EP31" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep32" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep32" offset="0x1D8" width="32" description="">
		<bitfield id="R_KEY_EP32" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep33" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep33" offset="0x1DC" width="32" description="">
		<bitfield id="R_KEY_EP33" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep34" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep34" offset="0x1E0" width="32" description="">
		<bitfield id="R_KEY_EP34" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep35" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep35" offset="0x1E4" width="32" description="">
		<bitfield id="R_KEY_EP35" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep36" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep36" offset="0x1E8" width="32" description="">
		<bitfield id="R_KEY_EP36" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep37" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyep37" offset="0x1EC" width="32" description="">
		<bitfield id="R_KEY_EP37" width="32" begin="31" end="0" resetval="0x0" description="Key EP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya30" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya30" offset="0x1F0" width="32" description="">
		<bitfield id="R_KEY_A30" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya31" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya31" offset="0x1F4" width="32" description="">
		<bitfield id="R_KEY_A31" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya32" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya32" offset="0x1F8" width="32" description="">
		<bitfield id="R_KEY_A32" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya33" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeya33" offset="0x1FC" width="32" description="">
		<bitfield id="R_KEY_A33" width="32" begin="31" end="0" resetval="0x0" description="Key A" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap30" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap30" offset="0x200" width="32" description="">
		<bitfield id="R_KEY_AP30" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap31" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap31" offset="0x204" width="32" description="">
		<bitfield id="R_KEY_AP31" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap32" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap32" offset="0x208" width="32" description="">
		<bitfield id="R_KEY_AP32" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap33" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rkeyap33" offset="0x20C" width="32" description="">
		<bitfield id="R_KEY_AP33" width="32" begin="31" end="0" resetval="0x0" description="Key AP" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv30" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv30" offset="0x210" width="32" description="">
		<bitfield id="R_IV30" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
