IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/FSS0_FSAS_0_OTFA_CFG.xml
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv31" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv31" offset="0x214" width="32" description="">
		<bitfield id="R_IV31" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv32" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv32" offset="0x218" width="32" description="">
		<bitfield id="R_IV32" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv33" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_riv33" offset="0x21C" width="32" description="">
		<bitfield id="R_IV33" width="32" begin="31" end="0" resetval="0x0" description="IV" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_irqaddinfo0" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_irqaddinfo0" offset="0x220" width="32" description="">
		<bitfield id="IRQ_MADDR" width="32" begin="31" end="0" resetval="0x0" description="Master Address which caused the event" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_irqaddinfo1" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_irqaddinfo1" offset="0x224" width="32" description="">
		<bitfield id="IRQ_MLEN" width="4" begin="17" end="14" resetval="0x0" description="Master LENGTH  which caused the event" range="17 - 14" rwaccess="R"/> 
		<bitfield id="IRQ_MSEQ" width="3" begin="13" end="11" resetval="0x0" description="Master SEQ  which caused the event" range="13 - 11" rwaccess="R"/> 
		<bitfield id="IRQ_MCMD" width="3" begin="10" end="8" resetval="0x0" description="Master CMD  which caused the event" range="10 - 8" rwaccess="R"/> 
		<bitfield id="IRQ_MID" width="8" begin="7" end="0" resetval="0x0" description="Master TAG ID  which caused the event" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_maccacheinfo" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_maccacheinfo" offset="0x228" width="32" description="">
		<bitfield id="CACHE_MISS_EVENT_CNT" width="16" begin="15" end="0" resetval="0x0" description="MAC Cache Miss event cnt" range="15 - 0" rwaccess="R"/>
	</register>
	<register id="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rmwrmcnt" acronym="FSAS__FSAS_OTFA_CFG__FSAS_OTFA_REGS_rmwrmcnt" offset="0x22C" width="32" description="">
		<bitfield id="RM_EVENT_CNT" width="16" begin="31" end="16" resetval="0x0" description="RM event cnt" range="31 - 16" rwaccess="R"/> 
		<bitfield id="RMW_EVENT_CNT" width="16" begin="15" end="0" resetval="0x0" description="RMW event cnt" range="15 - 0" rwaccess="R"/>
	</register>
</module>